app/views/groups/_categories.html.erb

          <h5 class="card-title "><%= link_to group.name, group_path(group), class: "text-decoration-none" %></h5>
          <p class="card-text"><small class="text-muted fs-6"><%= group.created_at.strftime("%d-%b-%Y")%></small></p>
---
INSERT INTO "groups" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

      <div class="col d-flex justify-content-evenly flex-column">
        <p> $<%= group.expenses.sum(:amount)%></p>
---
SELECT SUM("expenses"."amount") FROM "expenses" INNER JOIN "expenses_groups" ON "expenses"."id" = "expenses_groups"."expense_id" WHERE "expenses_groups"."group_id" = $1  [["group_id", 4]]