app/controllers/expenses_controller.rb

INSERT INTO "expenses" ("name", "amount", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ali"], ["amount", "20000.0"], ["created_at", "2022-10-25 22:32:57.986581"], ["updated_at", "2022-10-25 22:32:57.986581"], ["author_id", 1]]
---
  def create
    @expense = Expense.new(expense_params)
    @expense.author = current_user

    respond_to do |format|
      if @expense.save

SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "expenses" WHERE "expenses"."id" = $1  [["id", 3]]
---
  def destroy
    @expense = Expense.find(params[:id])
    @expense.destroy