app/controllers/groups_controller.rb

  def index
    @groups = current_user.groups.order(:name)
---
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1 ORDER BY "groups"."name" ASC  [["user_id", 2]]

  def show
    @group = Group.find(params[:id])
    @expenses = @group.expenses.order('created_at DESC')
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "expenses".* FROM "expenses" INNER JOIN "expenses_groups" ON "expenses"."id" = "expenses_groups"."expense_id" WHERE "expenses_groups"."group_id" = $1 ORDER BY created_at DESC  [["group_id", 1]]

  def create
    @group = current_user.groups.new(group_params)

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def destroy
    @group = Group.find(params[:id])
    @group.destroy
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 4]]